GNU Prolog 1.4.4 (64 bits)
Compiled Nov  6 2014, 18:04:28 with gcc
By Daniel Diaz
Copyright (C) 1999-2013 Daniel Diaz
| ?- $Id: group2.tests,v 1.2 2016-11-21 14:06:16-08 - - $

yes
| ?- compiling /afs/cats.ucsc.edu/users/u/njlie/private/112/asg4/Examples/.score/database.pl for byte code...
/afs/cats.ucsc.edu/users/u/njlie/private/112/asg4/Examples/.score/database.pl compiled, 75 lines read - 11203 bytes written, 11 ms

(3 ms) yes
| ?- compiling /afs/cats.ucsc.edu/users/u/njlie/private/112/asg4/Examples/.score/functions.pl for byte code...
/afs/cats.ucsc.edu/users/u/njlie/private/112/asg4/Examples/.score/functions.pl compiled, 112 lines read - 16513 bytes written, 12 ms

(4 ms) yes
| ?- 

no
| ?- depart sfo San Francisco    09:00
arrive lax Los Angeles      09:25
depart lax Los Angeles      12:00
arrive sjc San Jose         12:23


yes
| ?- depart sjc San Jose         11:15
arrive lax Los Angeles      11:38


yes
| ?- depart sfo San Francisco    09:00
arrive lax Los Angeles      09:25
depart lax Los Angeles      13:30
arrive sea Seattle-Tacoma   14:41


yes
| ?- depart mia Miami            09:00
arrive atl Atlanta          09:44
depart atl Atlanta          11:30
arrive lax Los Angeles      13:55


yes
| ?- depart mia Miami            09:00
arrive atl Atlanta          09:44
depart atl Atlanta          11:30
arrive lax Los Angeles      13:55
depart lax Los Angeles      15:30
arrive sjc San Jose         15:53


yes
| ?- depart lax Los Angeles      14:00
arrive nyc New York City    17:03


yes
| ?- 
